import streamlit as st
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

st.title('เกษียณแล้วปลอดภัยวางใจมิจฉาชีพ ❗❓')
st.markdown('วิเคราะห์ข้อมูลอาชญากรรมออนไลน์โดยใช้ข้อมูลและเทคนิคการวิเคราะห์เพื่อทำความเข้าใจพฤติกรรม รูปแบบ และแนวโน้มของอาชญากรรมที่เกิดขึ้นในโลกออนไลน์ โดยมีเป้าหมายเพื่อป้องกันและรับมือกับภัยคุกคามต่าง ๆ ที่เกิดขึ้นในพื้นที่')

st.subheader('ชุดข้อมูล')

criminal = pd.read_csv('aoc_cleansing.csv')
criminal.index = range(1, 11)
criminal['ภูมิภาค'] = ['ใต้', 'กลาง','กลาง','กลาง','อีสาน','เหนือ','กลาง','อีสาน','เหนือ','กลาง']
criminal.columns = ['เพศ','อายุ','อาชีพ','จังหวัด','อำเภอ','ตำบล','รหัสไปรษณีย์','ประเภทอาชญากรรม','วันเวลาที่รับเรื่อง','สถานะ','วันเวลาที่ปิดเรื่อง','ธนาคาร','มูลค่าความเสียหาย','การระงับบัญชี','ภูมิภาค']
st.write('***ขนาด :*** '+str(criminal.shape[0] )+' แถว '+str(criminal.shape[1])+' คอลัมน์')
st.dataframe(criminal)

lost_money = criminal['มูลค่าความเสียหาย'].sum()
formatted_lost_money = "{:,}".format(int(lost_money))
st.subheader('รู้หรือไม่? ในเดือนพฤศจิกายน ปี 2566 ที่ผ่านมา คนวัยเกษียนโดนอาชญากรรมสูญเสียเป็นเงินมูลค่ากว่า '+str(formatted_lost_money)+' บาท  🤯😫')

st.subheader('ในประเภทอาชญากรรมแต่ละประเภทมีลักษณะการเกิดความเสียหายเป็นอย่างไรบ้าง')

#st.write(criminal[['ประเภทอาชญากรรม','มูลค่าความเสียหาย']])

option : str = st.selectbox(
    "คุณต้องการดูอาชญากรรมประเภทไหน?",
    (criminal['ประเภทอาชญากรรม'].unique()),)

new_df=criminal.loc[criminal['ประเภทอาชญากรรม'] == option, 'มูลค่าความเสียหาย']

show=new_df.sum()
showmoney = "{:,}".format(int(show))
st.subheader(f'มีค่าเสียหายรวมกว่า  {showmoney} บาท 😭')

st.text('______________________________________________________________________________________________________________________________________________________________________________________')

def plot_pie_gander():
    st.subheader('โดยพบอาชญากรรมออนไลน์เกิดกับเพศหญิงถึง 60 %🏳️‍🌈')
    fig = px.pie(criminal['เพศ'], names='เพศ',color='เพศ',
                 width=800, height=600,
                 color_discrete_map={"หญิง": 'pink'})
    st.write(fig)

st.subheader('ต่อจากนี้เรามาดูสมมุติฐานความเป็นไปได้ของการตกเป็นเหยื่อ หรือ pattern อะไรบ้างที่เหยือมี 🕵️‍♂️🤝')
plot_pie_gander()
st.write(criminal[['เพศ','ประเภทอาชญากรรม','มูลค่าความเสียหาย']])

st.subheader('***สมมุติฐานลักษณะของคนที่มักจะตกเป็นเหยี่ออาชญากรรมออนไลน์***🕵️‍♂️')
st.subheader('(1)  จากข้อมูลเพศหญิงจะตกเป็นของรูปแบบ คดีหลอกลวงซื้อขายสินค้าหรือบริการ อาจเป็นเพราะเพศหญิงมีพฤติกรรมของการชอบ shopping เลือกซื้อของออนไลน์และติดตามสินค้าและบริการ มากกว่าเพศชาย')

st.subheader('(2)  คดีที่มีมูลค่าความเสียหายเยอะที่สุดในช่วงพฤศจิกายนเกิดกับเพศหญิงเช่นกัน')


def plot_bar_amphoe():
    st.subheader('พื้นที่เมืองที่เจริญกว่า แต่อาจไม่ได้ปลอดภัยกว่า')
    st.subheader("ผู้ที่ตกเป็นเหยื่อส่วนใหญ่อาศัยอยู่ในอำเภอเมือง")
    provice = pd.DataFrame(criminal['อำเภอ'])

    fig2 = px.bar(provice, x='อำเภอ', labels='จำนวน',range_y=[0,5] ,color="อำเภอ" ,
                 width=800, height=600)
    fig2.update_layout(
    yaxis=dict(
        title_text="จำนวน",
        titlefont=dict(size=30),
    ),
     xaxis=dict(
        title_text="อำเภอ",
        titlefont=dict(size=30),
    ))

    st.write(fig2)

st.text('_____________________________________________________________________________________________________')

plot_bar_amphoe()

def plot_hist_pumip():
    st.subheader('รวมถึงพื้นที่ภาคกลางมีการแจ้งเหตุมามากที่สุด')
    fig = px.histogram(criminal['ภูมิภาค'], x="ภูมิภาค",color='ภูมิภาค',
                 width=800, height=600)
    fig.update_layout(
    yaxis=dict(
        title_text="จำนวน",
        titlefont=dict(size=30),
    ),
    xaxis=dict(
        title_text="ภูมิภาค",
        titlefont=dict(size=30),
    ))
    st.write(fig)
    st.subheader('***สมมุติฐานลักษณะของคนที่มักจะตกเป็นเหยี่ออาชญากรรมออนไลน์*** 😱')
    st.subheader('(1)  จากข้อมูลที่อยู่ของเหยื่อจะมักจะเกิดเหตุอาชญากรรมส่วนมากเกิดที่อำเภอที่เข้าถึงความเจริญได้มากกว่า')
    st.subheader('(2)  กว่าครึ่งหนึ่งของการเกิดเหตุเป็นพื้นที่ภาคกลาง')

    st.subheader('จาก 2 สมมุติฐานเบื้องต้น เราสามารถสัญนิฐานได้ว่า พฤติกรรมของมิจฉาชีพอาจจะเลือกเหยื่อที่อยู่ในพื้นที่ที่เจริญ มีการเข้าถึงสินค้าบริการและเทคโนโลยีได้มากกว่า')

st.text('__________________________________________________________________________________________________')

plot_hist_pumip()


st.text('__________________________________________________________________________________________________')

st.subheader('บุลคลที่เคยรับราชการมีค่าเฉลี่ยของมูลค่าความเสียหายจากอาชญากรรมออนไลน์มากกว่าอาชีพอื่น🕵️‍♂️')

data = {
    'อาชีพ':['ข้าราชการบำนาญ','อาชีพอื่นๆ'],
    'ค่าเฉลื่ยความเสียหายต่อคน':[551061,56641]
}

df = pd.DataFrame(data)

def plot_bar_mean_jobs():
    fig = px.bar(df, x='อาชีพ', y='ค่าเฉลื่ยความเสียหายต่อคน', title='ค่าเฉลื่ยความเสียหายต่อคน ของแต่ละอาชีพ'
                 ,color="อาชีพ",
                 color_discrete_map={"ข้าราชการบำนาญ": 'red'})
    fig.update_layout(
    yaxis=dict(
        title_text="ค่าเฉลื่ยความเสียหายต่อคน",
        titlefont=dict(size=25),
    ),
    xaxis=dict(
        title_text="อาชีพ",
        titlefont=dict(size=25),
    ))

    st.write(fig)
    st.subheader('***สมมุติฐานที่น่าสนใจ***')
    st.subheader('(1)  คนที่เคยรับราชการมีค่าเสียหายสูงกว่าอาชีพอื่นๆ ถึงราวๆ 10 เท่า')
    st.subheader('เนื่องโดยปัจจัยที่เป็นอาชีพที่มั่นคงเมื่อเกษียน เลยมีความตะหนักหรือระวังกับอาชญากรรมทางออนไลน์น้อยกว่าหรือไม่❓')

plot_bar_mean_jobs()
